import Mock from 'mockjs';

Mock.mock(`${process.env.VUE_APP_API_BASE_URL}/profile/getFilter`, 'get', () => {
    return [
        [{
                name: "投稿阶段",
                children: ["投稿阶段稿件", "待作者缴纳稿费", "待作者上传材料", "材料待确认"]
            },
            {
                name: "初审阶段",
                children: ["初审阶段稿件", "待初审", "初审返修中", "初审修回"]
            },
            {
                name: "专审阶段",
                children: ["专审阶段稿件", "待专审", "送外审中", "外审修回", "外审返修中", "作者修回"]
            },
            {
                name: "终审阶段",
                children: ["终审阶段稿件", "待终审", "终审返修中", "终审修回"]
            },
            {
                name: "排期排栏",
                children: ["排期排栏阶段稿件", "待排期排栏", "调排调栏", "终审返修回的稿件"]
            },
            {
                name: "清样阶段",
                children: ["清样阶段稿件", "待责编编校", "待清样上传", "待清样确认"]
            },
            {
                name: "发布阶段",
                children: ["发布阶段稿件", "待发布", "待邮寄", "被撤销"]
            },
        ],
        [{
                name: "稿件类型",
                children: ["合作稿件", "加急稿件", "基金稿件", "增刊稿件", "转他刊稿件", "责任期稿件"]
            },
            {
                name: "初审阶段",
                children: ["初审阶段稿件", "待初审", "初审返修中", "初审修回"]
            },
            {
                name: "专审阶段",
                children: ["专审阶段稿件", "待专审", "送外审中", "外审修回", "外审返修中", "作者修回"]
            },
            {
                name: "终审阶段",
                children: ["终审阶段稿件", "待终审", "终审返修中", "终审修回"]
            },
            {
                name: "排期排栏",
                children: ["排期排栏阶段稿件", "待排期排栏", "调排调栏", "终审返修回的稿件"]
            },
            {
                name: "清样阶段",
                children: ["清样阶段稿件", "待责编编校", "待清样上传", "待清样确认"]
            },
            {
                name: "发布阶段",
                children: ["发布阶段稿件", "待发布", "待邮寄", "被撤销"]
            },
        ],
        [{
            name: "缴费情况",
            children: ["待交审稿费", "版面费待定", "待交版面费", "加急费待定", "待交加急费", "减免费待定", "减免费待退"]
        }, ],
    ]
})